
#** طريقة عمل داله خاصة بي ****

#* اعرف الكمبيوتر على الفونكتشن واكتب الفونكتشن بعد التعريف وعمل لها كوماين للمحاذاه
def riad():
    #* هنا اخزن الذي اريده داخل الفونكتشن الخاصه بي
    print("Riad Saleh Alhlaly") 
#* اذا اردت استدعاء الفونكتشن او بمعناء عندما اريد طباعتها استحدم التالي    
riad()    

#***********************************************************************************

#* كود يطهر رساله للمستخدم 
def riad():
    #* اهلن بك في الداله الخاصه بي
    print("Welcome to the program")
#* استدعيتها لتطهر للمستخدم    
riad() 

def name(): #* فونكتشن خاصه للوداع عند الخروج من البرنامج
    #* رسالة الوداع خزنتها في الفونكتشن خاصه
    print("Thanks for using the program. See tou soon!")
#* طلب من المستخدم ضغط انتر للخروج من البرنامج     
input("Press Enter to exit:")
#* استدعا فونكتشن الوداع
name()        