
#*************( مشروع بناء كود لعبة هان مان كاملة )****************
#* ما تم استخدامة في بناء الكود
# طلب المكتبة العشوائية
# قائمة فيها رسومات اللعبة
# قائمة للاسماء التي يختار منها الكمبيوتر عشوائي
# تبديل حروف الكلمة بفراغات
# طلب من المستخدم تخمين حرف
# دائرة التحقق: اذا كان صحيح. بدل المسافة بحرف واطبع
# التاكد من ان الحرف لم يسبق تخمينة من قبل
# اذا كان التخمين غير صحيح
# طباعة حبل المشنقة اذا اخطاء في محاوله تدريجياً
# التحقق : اذا كانت قائمة الفراغات  فارغة اضهار رسالة الفوز 
# واذا مازالت الفراغات موجوده في القائمة والمحاولات انتهت اطبع التالي 


import random
# مراحل هانج مان
graphics=[
    """ 
  +---+
  |   |
      |
      |
      |
      |
=========""",
"""
  +---+
  |   |
  O   |
      |
      |
      |
=========""",
"""
  +---+
  |   |
  O   |
  |   |
      |
      |
=========""",
"""
  +---+
  |   |
  O   |
 /|   |
      |
      |
=========""",
"""
  +---+
  |   |
  O   |
 /|\  |
      |
      |
=========""",
"""
  +---+
  |   |
  O   |
 /|\  |
 /    |
      |
========="""]


words = ["good","bad","ugly"]
random_word=random.choice(words).lower()
#* اعرض مسافات بنفس عدد حروف الكلمة
display=["_"] * len(random_word)
#* طباعة فراغات خالية من الفواصل والقائمة
print("  ".join(display))
lives=6

print(""" 
  +---+
      |
      |
      |
      |
      |
=========
      """)

# قائمة لتخزين الحروف التي تم تخمينها 
reference=[]
while "_" in display and lives > 0 :
    #** اطلب تخمين حرف
    guessed=input("Pleasse guess a letter : ").lower()
    
    #* التاكد من ان الحرف لم يسبق تخمينة من قبل
    # هل الحرف تم تخمينة من قبل
    if guessed in reference:
      print("You already guessed that. Try again.")
      # عدد المحاولات المتبقية
      print(f"You have {lives} more tries")
      # اعاده قراية اللوب من البداية
      continue
    
    # اذا كان التخمين غير صحيح
    if guessed not in random_word:
        # طباعة حبل المشنقة اذا اخطاء في محاوله تدريجياً
        print(graphics[0-lives])
        lives -=1
        # في حالة لم يسبق تخمينة. ضيفة للقائمة
        reference.append(guessed)
        
        #* اذا لم يتحقق الشروط السابقة ننفذ التالي
    else:
      #** لو صحيح , بدل المسافة بحرف        
      for position in range(len(random_word)):
        if guessed == random_word[position]:
          display[position]=guessed
    # طباعة الحرف المخمن في مكانة الصحيح بدل الفراغ
    print("  ".join(display))
    # اضهار عدد المحاولات المتقية
    print(f"You have {lives} more tries")
            
# التحقق : اذا كانت قائمة الفراغات  فارغة اضهار رسالة الفوز            
if "_" not in display:
    print("""
    ************
    YOU WIN!
    ************
""")
    
# واذا مازالت الفراغات موجوده في القائمة والمحاولات انتهت اطبع التالي    
else:
    print("""
          You losw!
          """)
    print("""
  +---+
  |   |
  O   |
 /|\  |
 / \  |
      |
=========
""")


